[{"id": "1501", "question": "How many movies did Stanley Kubrick direct?", "sparql_query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Stanley_Kubrick>  . }", "answers": {"head": {"link": [], "vars": ["callret-0"]}, "results": {"distinct": false, "ordered": true, "bindings": [{"callret-0": {"type": "typed-literal", "datatype": "http://www.w3.org/2001/XMLSchema#integer", "value": "16"}}]}}},
{"id": "2586", "question": "Which city's foundeer is John Forbes?", "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/founder> <http://dbpedia.org/resource/John_Forbes_(British_Army_officer)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>}", "answers": {"head": {"link": [], "vars": ["uri"]}, "results": {"distinct": false, "ordered": true, "bindings": [{"uri": {"type": "uri", "value": "http://dbpedia.org/resource/Pittsburgh"}}]}}},
{"id": "2653", "question": "What is the river whose mouth is in deadsea?", "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Dead_Sea>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "answers": {"head": {"link": [], "vars": ["uri"]}, "results": {"distinct": false, "ordered": true, "bindings": [{"uri": {"type": "uri", "value": "http://dbpedia.org/resource/Jordan_River"}}]}}},
{"id": "1055", "question": "What is the allegiance of John Kotelawala ?", "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Kotelawala> <http://dbpedia.org/property/allegiance> ?uri } ", "answers": {"head": {"link": [], "vars": ["uri"]}, "results": {"distinct": false, "ordered": true, "bindings": [{"uri": {"type": "uri", "value": "http://dbpedia.org/resource/Ceylon"}}]}}},
{"id": "1701", "question": "Which architect of Marine Corps Air Station Kaneohe Bay was also tenant of New Sanno hotel /'", "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marine_Corps_Air_Station_Kaneohe_Bay> <http://dbpedia.org/property/architect> ?uri. <http://dbpedia.org/resource/New_Sanno_Hotel> <http://dbpedia.org/ontology/tenant> ?uri} ", "answers": {"head": {"link": [], "vars": ["uri"]}, "results": {"distinct": false, "ordered": true, "bindings": []}}},
{"id": "3293", "question": "Which sects people are part of local political parties which fall under the International Muslim Brotherhood?", "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/international> <http://dbpedia.org/resource/Muslim_Brotherhood> . ?x <http://dbpedia.org/ontology/religion> ?uri  . ?x<http://www.w3.org/1999/02/22-rdf-syntax-ns#type><http://dbpedia.org/ontology/PoliticalParty>}","answers":{"head":{"link":[],"vars":["uri"]},"results":{"distinct": false, "ordered": true, "bindings": [{"uri": {"type": "uri", "value": "http://dbpedia.org/resource/Sunni_Islam"}}, {"uri": {"type": "uri", "value": "http://dbpedia.org/resource/Islam"}}]}}},
 {"id": "2161", "question": "List common systems are developed by of the Google Videos and written by of the Google Web Toolkit ?", "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Google_Videos> <http://dbpedia.org/property/developer> ?uri. <http://dbpedia.org/resource/Google_Web_Toolkit> <http://dbpedia.org/ontology/author> ?uri} ", "answers": {"head": {"link": [], "vars": ["uri"]}, "results": {"distinct": false, "ordered": true, "bindings": []}}},
  {"id": "1136", "question": "For which games are Sam Loyd and Eric Schiller both famous?", "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sam_Loyd> <http://dbpedia.org/ontology/knownFor> ?uri. <http://dbpedia.org/resource/Eric_Schiller> <http://dbpedia.org/ontology/knownFor> ?uri . }", "answers": {"head": {"link": [], "vars": ["uri"]}, "results": {"distinct": false, "ordered": true, "bindings": [{"uri": {"type": "uri", "value": "http://dbpedia.org/resource/Chess"}}]}}}]
